package ОсновыJava.УправляющиеИнструкции;
// Сила тяжести на Луне примерно равна 17%, напишите программу, которая вычисляет ваш вес на Луне.
public class MoonWeight {
    public static void main(String[] args) {
        int vesEart =80;
        double x;
        x= vesEart*0.17;
        System.out.println(" ves na  Moon =" + x);
    }
}
