package ОсновыJava.УправляющиеИнструкции;
/*Строковые литералы
Помимо обычных символов, строковый литерал также может содержать вышеупомянутые
управляющие последовательности. Рассмотрим в качестве примера
следующую программу, в которой применяются управляющие последовательности
\п и \ t .*/
public class StrDemo {
    public static void main(String args[]) {

        System.out.println("Первая строка\nВторая строка");
        System.out.println("A\tB\tC");
        System.out.println("D\tE\tF");
    }
}
