package ОсновыJava.КлассыОбьектыМетоды;
/*При определении класса вы объявляете его конкретный вид и поведение.
Для этого указываются содержащиеся в нем переменные экземпляра и оперирующие
ими методы. Простейшие классы могут содержать только код или только
данные, однако большинство реальных классов содержит и то и другое.
Класс создается с помощью ключевого слова c l a s s . Ниже приведен упрощенный
общий синтаксис определения класса.*/
public class ИмяКласса {
 /*   // объявление переменных экземпляра
    тип переменная1;
    тип переменная2;
//...
    тип переменнаяЫ;
    // объявление методов
    тип метод 1(параметры)

    {
// тело метода
    }

    тип метод2(
            параметры) {
// тело метода
    }
//...

    тип методы(параметры) {
// тело метода
    }
}*/
}